share/tutorials/heat-transfer/buoyant-boussinesq-simple/hot_room/0.org/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  floor
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  ceiling
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  fixedWalls
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
